#include<iostream>
using namespace std;

void main()
{
	setlocale(LC_ALL, "Russian");

	cout << "\t\t\t\t\t\tВ лесу родилась ёлочка,\n";
	cout << "\t\t\t\t\t\tВ лесу она росла, \n";
	cout << "\t\t\t\t\t\tЗимой и летом стройная,\n";
	cout << "\t\t\t\t\t\tЗелёная была, \n\n";

	cout << "\t\t\t\t\t\tМетель ей пела песенку:\n";
	cout << "\t\t\t\t\t\t\"Спи, ёлочка, бай-бай!\"\n";
	cout << "\t\t\t\t\t\tМороз снежком укутывал:\n";
	cout << "\t\t\t\t\t\t\"Смотри, не замерзай!\"\n\n";

	cout << "\t\t\t\t\t\tТрусишка зайка серенький\n\t\t\t\t\t\tПод ёлочкой скакал.\n";
	cout << "\t\t\t\t\t\tПорою волк, сердитый волк,\n\t\t\t\t\t\tРысцою пробегал.\n\n";

	cout << "\t\t\t\t\t\tЧу! Снег по лесу частому\n\t\t\t\t\t\tПод полозом скрипит.\n";
	cout << "\t\t\t\t\t\tЛошадка мохноногая\n\t\t\t\t\t\tТоропится, бежит.\n\n";

	cout << "\t\t\t\t\t\tВезёт лошадка дровеньки,\n\t\t\t\t\t\tНа дровнях мужичок.\n";
	cout << "\t\t\t\t\t\tСрубил он нашу ёлочку\n\t\t\t\t\t\tПод самый корешок.\n\n";

	cout << "\t\t\t\t\t\tТеперь ты здесь, нарядная,\n\t\t\t\t\t\tНа праздник к нам пришла\n";
	cout << "\t\t\t\t\t\tИ много, много радости\n\t\t\t\t\t\tДетишкам принесла.\n\n";
}